app/views/todo_lists/_card.html.slim

  ul.list-group.list-group-flush
    - todo_list_card.todo_items.take(2).each do |item|
---
SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ? LIMIT ?  [["todo_list_id", 7], ["LIMIT", 2]]