app/views/todo_lists/index.html.slim

          .form-group
            = f.select :tags_eq, options_for_select(TodoList.tags), {}, { :class => "select-form" }
---
SELECT "todo_lists".* FROM "todo_lists"