app/views/todo_lists/show.html.slim

SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ?  [["todo_list_id", 7]]
---
    ul
    - @todo_list.todo_items.each do |item|