app/controllers/todo_items_controller.rb

SELECT  "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
class TodoItemsController < ApplicationController

  before_action do
    @todo_list = TodoList.find(params[:todo_list_id])

INSERT INTO "todo_items" ("content", "todo_list_id") VALUES (?, ?)  [["content", "test"], ["todo_list_id", 15]]
---
  def create
    @todo_item = @todo_list.todo_items.build todo_item_params
    if @todo_item.save