app/controllers/todo_lists_controller.rb

INSERT INTO "todo_lists" ("name") VALUES (?)  [["name", "test"]]
---
  def create
    @todo_list = TodoList.create todo_list_params