app/controllers/todo_lists_controller.rb

class TodoListsController < ApplicationController

  before_action only: [:update, :edit, :show] do
    @todo_list = TodoList.find(params[:id])
---
SELECT  "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def index
    if params[:tag_name].present?
      @todo_lists = TodoList.joins(:tags).where(tags: {name: params[:tag_name]})
    else
      @todo_lists = TodoList.all
---
SELECT "todo_lists".* FROM "todo_lists"

  def create
    @todo_list = TodoList.create todo_list_params
    @todo_list.todo_items.build

    binding.pry
    if @todo_list.save
      params[:todo_list][:tags_attributes][:name].each do |tag_name|
        tag = Tag.find_or_create_by tag_name
        @todo_list << tag
---
INSERT INTO "todo_lists" ("name", "description") VALUES (?, ?)  [["name", "Test"], ["description", "test"]]
INSERT INTO "todo_items" ("content", "todo_list_id") VALUES (?, ?)  [["content", "test"], ["todo_list_id", 48]]
INSERT INTO "todo_items" ("content", "todo_list_id") VALUES (?, ?)  [["content", "test"], ["todo_list_id", 49]]

  def update
    @todo_list.update todo_list_params
---
UPDATE "todo_lists" SET "description" = ? WHERE "todo_lists"."id" = ?  [["description", "liste de test modifié"], ["id", 10]]